samutronics/2026_0625_TM4C1294_MQTT_IO/mqtt_io/config.c
const char *
ConfigShutterName(int iSlot)
{
    if((iSlot < 0) || (iSlot >= CFG_MAX_SHUTTERS)) { return(""); }
    return(g_sOutCfg.pcShName[iSlot]);
}

void
ConfigShutterNameSet(int iSlot, const char *pcName)
{
    if((iSlot < 0) || (iSlot >= CFG_MAX_SHUTTERS)) { return; }
    memset(g_sOutCfg.pcShName[iSlot], 0, CFG_NAME_LEN);
    if(pcName) { strncpy(g_sOutCfg.pcShName[iSlot], pcName, CFG_NAME_LEN - 1); }
}

int
ConfigShutterOfRelay(int iOut, bool *pbIsUp)
{
    int i;
    if((iOut < 0) || (iOut >= CFG_MAX_OUTPUTS)) { return(-1); }
    for(i = 0; i < CFG_MAX_SHUTTERS; i++)
    {
        if(g_sOutCfg.ui8ShUp[i] == SHUTTER_NONE) { continue; }
        if((int)g_sOutCfg.ui8ShUp[i] == iOut)
        {
            if(pbIsUp) { *pbIsUp = true; }
            return(i);
        }
        if((int)g_sOutCfg.ui8ShDown[i] == iOut)
        {
            if(pbIsUp) { *pbIsUp = false; }
            return(i);
        }
    }
    return(-1);
}

//*****************************************************************************
//
// Persist the complete tOutputConfig record to EEPROM.
//
//*****************************************************************************
bool
ConfigOutputSave(void)
{
    uint32_t ui32Rc;

    g_sOutCfg.ui32Magic = CFG_OUTCFG_MAGIC;
    g_sOutCfg.ui32Crc   = ConfigCRC32((const uint8_t *)&g_sOutCfg,
                                      sizeof(tOutputConfig) - sizeof(uint32_t));
    ui32Rc = EEPROMProgram((uint32_t *)&g_sOutCfg, CFG_OUTCFG_ADDR,
                           sizeof(tOutputConfig));
    if(ui32Rc != 0)
    {
        UARTprintf("EEPROM write failed (output config, 0x%x).\n", ui32Rc);
        return(false);
    }
    UARTprintf("Output config saved to EEPROM.\n");
    return(true);
}

//*****************************************************************************
//
// Room / zone accessors.  Room index 0..CFG_MAX_ROOMS-1; ROOM_NONE = unassigned.
// A room is "defined" on the UI side when its name is non-empty.
//
//*****************************************************************************
const char *
ConfigRoomName(int iRoom)
{
    if((iRoom < 0) || (iRoom >= CFG_MAX_ROOMS)) { return(""); }
    return(g_sRoomCfg.pcRoomName[iRoom]);
}

void
ConfigRoomNameSet(int iRoom, const char *pcName)
{
    if((iRoom < 0) || (iRoom >= CFG_MAX_ROOMS)) { return; }
    memset(g_sRoomCfg.pcRoomName[iRoom], 0, CFG_NAME_LEN);
    if(pcName) { strncpy(g_sRoomCfg.pcRoomName[iRoom], pcName, CFG_NAME_LEN - 1); }
}

uint8_t
ConfigOutRoom(int iOut)
{
    if((iOut < 0) || (iOut >= CFG_MAX_OUTPUTS)) { return(ROOM_NONE); }
    return(g_sRoomCfg.ui8OutRoom[iOut]);
}

void
ConfigOutRoomSet(int iOut, uint8_t ui8Room)
{
    if((iOut < 0) || (iOut >= CFG_MAX_OUTPUTS)) { return; }
    g_sRoomCfg.ui8OutRoom[iOut] = (ui8Room < CFG_MAX_ROOMS) ? ui8Room : ROOM_NONE;
}

uint8_t
ConfigShRoom(int iShutter)
{
    if((iShutter < 0) || (iShutter >= CFG_MAX_SHUTTERS)) { return(ROOM_NONE); }
    return(g_sRoomCfg.ui8ShRoom[iShutter]);
}

void
ConfigShRoomSet(int iShutter, uint8_t ui8Room)
{
    if((iShutter < 0) || (iShutter >= CFG_MAX_SHUTTERS)) { return; }
    g_sRoomCfg.ui8ShRoom[iShutter] = (ui8Room < CFG_MAX_ROOMS) ? ui8Room : ROOM_NONE;
}

void
ConfigRoomSetDefaults(void)
{
    int i;
    memset(&g_sRoomCfg, 0, sizeof(tRoomConfig));
    g_sRoomCfg.ui32Magic = CFG_ROOMCFG_MAGIC;
    for(i = 0; i < CFG_MAX_OUTPUTS; i++)  { g_sRoomCfg.ui8OutRoom[i] = ROOM_NONE; }
    for(i = 0; i < CFG_MAX_SHUTTERS; i++) { g_sRoomCfg.ui8ShRoom[i]  = ROOM_NONE; }
}

bool
ConfigRoomSave(void)
{
    uint32_t ui32Rc;

    g_sRoomCfg.ui32Magic = CFG_ROOMCFG_MAGIC;
    g_sRoomCfg.ui32Crc   = ConfigCRC32((const uint8_t *)&g_sRoomCfg,
                                       sizeof(tRoomConfig) - sizeof(uint32_t));
    ui32Rc = EEPROMProgram((uint32_t *)&g_sRoomCfg, CFG_ROOMCFG_ADDR,
                           sizeof(tRoomConfig));
    if(ui32Rc != 0)
    {
        UARTprintf("EEPROM write failed (room config, 0x%x).\n", ui32Rc);
        return(false);
    }
    UARTprintf("Room config saved to EEPROM.\n");
    return(true);
}

//*****************************************************************************
//
// NTP configuration accessors.
//
//*****************************************************************************
const tNTPConfig *
ConfigNtpGet(void)
{
    return(&g_sNTPConfig);
}

void
ConfigNtpSetServer(const char *pcServer)
{
    memset(g_sNTPConfig.pcServer, 0, CFG_NTP_SERVER_LEN);
    strncpy(g_sNTPConfig.pcServer, pcServer, CFG_NTP_SERVER_LEN - 1);
}

void
ConfigNtpSetTz(int8_t i8Offset)
{
    g_sNTPConfig.i8TzOffset = i8Offset;
}

//*****************************************************************************
//
// Channel name accessors and EEPROM update.
//
//*****************************************************************************
const char *
ConfigGetInputName(int iInput)
{
    if(iInput < 0 || iInput >= CFG_NAMES_MAX_INPUTS)
    {
        return("");
    }
    return(g_sIONames.pcInputNames[iInput]);
}

const char *
ConfigGetOutputName(int iOutput)
{
    if(iOutput < 0 || iOutput >= CFG_NAMES_MAX_OUTPUTS)
    {
        return("");
    }
    return(g_sIONames.pcOutputNames[iOutput]);
}

//
// Write one name entry to RAM, then do a targeted 12-byte EEPROM write plus
// a 4-byte CRC update — no full 1544-byte rewrite needed.
//
void
ConfigNameSet(bool bInput, int iIdx, const char *pcName)
{
    char     *pcDst;
    uint32_t ui32Addr;

    if(bInput)
    {
        if(iIdx < 0 || iIdx >= CFG_NAMES_MAX_INPUTS) { return; }
        pcDst    = g_sIONames.pcInputNames[iIdx];
        ui32Addr = CFG_IO_NAMES_ADDR + 4u +
                   (uint32_t)iIdx * CFG_NAME_LEN;
    }
    else
    {
        if(iIdx < 0 || iIdx >= CFG_NAMES_MAX_OUTPUTS) { return; }
        pcDst    = g_sIONames.pcOutputNames[iIdx];
        ui32Addr = CFG_IO_NAMES_ADDR + 4u +
                   CFG_NAMES_MAX_INPUTS * CFG_NAME_LEN +
                   (uint32_t)iIdx * CFG_NAME_LEN;
    }

    memset(pcDst, 0, CFG_NAME_LEN);
    strncpy(pcDst, pcName, CFG_NAME_LEN - 1);

    // Persist the magic word on every targeted write so the record survives a
    // reboot even if ConfigNamesSave() was never called (e.g. after factory reset).
    EEPROMProgram(&g_sIONames.ui32Magic, CFG_IO_NAMES_ADDR, 4u);
    EEPROMProgram((uint32_t *)(uintptr_t)pcDst, ui32Addr, CFG_NAME_LEN);

    g_sIONames.ui32Crc = ConfigCRC32((const uint8_t *)&g_sIONames,
                                      sizeof(tIONames) - sizeof(uint32_t));
    EEPROMProgram(&g_sIONames.ui32Crc,
                  CFG_IO_NAMES_ADDR + sizeof(tIONames) - sizeof(uint32_t), 4u);
}

bool
ConfigNamesSave(void)
{
    uint32_t ui32Rc;
    g_sIONames.ui32Magic = CFG_IO_NAMES_MAGIC;
    g_sIONames.ui32Crc   = ConfigCRC32((const uint8_t *)&g_sIONames,
                                        sizeof(tIONames) - sizeof(uint32_t));
    ui32Rc = EEPROMProgram((uint32_t *)&g_sIONames, CFG_IO_NAMES_ADDR,
                           sizeof(tIONames));
    return(ui32Rc == 0);
}

bool
ConfigNtpSave(void)
{
    uint32_t ui32Rc;
    g_sNTPConfig.ui32Magic = CFG_NTP_MAGIC;
    g_sNTPConfig.ui32Crc   = ConfigCRC32((const uint8_t *)&g_sNTPConfig,
                                          sizeof(tNTPConfig) - sizeof(uint32_t));
    ui32Rc = EEPROMProgram((uint32_t *)&g_sNTPConfig, CFG_NTP_EEPROM_ADDR,
                           sizeof(tNTPConfig));
    if(ui32Rc != 0)
    {
        UARTprintf("EEPROM write failed (NTP config, 0x%x).\n", ui32Rc);
        return(false);
    }
    UARTprintf("NTP config saved to EEPROM.\n");
    return(true);
}
